# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLOv8 object detection model with MTI_Block & TemporalSlice
# Based on YOLOv8n

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone (保持不变)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4 (Backbone P3)
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6 (Backbone P4)
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9 (Backbone P5)

# YOLOv8.0n head (添加 MTI 和 TemporalSlice)
head:
  # --------------------------------------------------------
  # Step 1: 预处理 Backbone 的三个输出层
  # --------------------------------------------------------
  - [-1, 1, MTI_Block, [1024, 5, 4]] # 10: 处理 Backbone P5 (来自 Layer 9)
  # - [-1, 1, TemporalSlice, [5]]    # 10: 处理 Backbone P5 (来自 Layer 9)
  - [6, 1, MTI_Block, [512, 5, 4]] # 11: 处理 Backbone P4 (来自 Layer 6)
  - [4, 1, TemporalSlice, [5]]     # 12: 处理 Backbone P3 (来自 Layer 4)

  # --------------------------------------------------------
  # Step 2: FPN (Top-down)
  # --------------------------------------------------------
  - [10, 1, nn.Upsample, [None, 2, "nearest"]] # 13: 上采样 P5 (注意来源是 10)
  - [[-1, 11], 1, Concat, [1]]             # 14: Cat 上采样后的P5 + 处理后的P4 (11)
  - [-1, 3, C2f, [512]]                     # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16: 上采样 P4
  - [[-1, 12], 1, Concat, [1]]             # 17: Cat 上采样后的P4 + 处理后的P3 (12)
  - [-1, 3, C2f, [256]]                     # 18 (Head P3/8-small)

  # --------------------------------------------------------
  # Step 3: PAN (Bottom-up)
  # --------------------------------------------------------
  - [-1, 1, Conv, [256, 3, 2]]             # 19: 下采样
  - [[-1, 15], 1, Concat, [1]]             # 20: Cat Head P4 (Layer 15)
  - [-1, 3, C2f, [512]]                     # 21 (Head P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]             # 22: 下采样
  - [[-1, 10], 1, Concat, [1]]             # 23: Cat 处理后的P5 (Layer 10)
  - [-1, 3, C2f, [1024]]                    # 24 (Head P5/32-large)

  # --------------------------------------------------------
  # Step 4: Detect
  # --------------------------------------------------------
  - [[18, 21, 24], 1, Detect, [nc]] # Detect(P3, P4, P5)