# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# YOLOv10s object detection model with MTI_Block & TemporalSlice
# Based on YOLOv10s

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov10n.yaml' will call yolov10.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

# YOLOv10s backbone (保持不变)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]] # 4 (Backbone P3)
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]] # 6 (Backbone P4)
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2fCIB, [1024, True, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10 (Backbone P5)

# YOLOv10s head (添加 MTI 和 TemporalSlice)
head:
  # --------------------------------------------------------
  # Step 1: 预处理 Backbone 的三个输出层
  # --------------------------------------------------------
  - [-1, 1, MTI_Block, [1024, 5, 4]] # 11: 处理 Backbone P5 (来自 Layer 10)
  # - [-1, 1, TemporalSlice, [5]]    # 11: 处理 Backbone P5 (来自 Layer 10)
  - [6, 1, MTI_Block, [512, 5, 4]] # 12: 处理 Backbone P4 (来自 Layer 6)
  - [4, 1, TemporalSlice, [5]]     # 13: 处理 Backbone P3 (来自 Layer 4)

  # --------------------------------------------------------
  # Step 2: FPN (Top-down)
  # --------------------------------------------------------
  - [11, 1, nn.Upsample, [None, 2, "nearest"]] # 14: 上采样 P5 (注意来源是 11)
  - [[-1, 12], 1, Concat, [1]]             # 15: Cat 上采样后的P5 + 处理后的P4 (12)
  - [-1, 3, C2f, [512]]                     # 16

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17: 上采样 P4
  - [[-1, 13], 1, Concat, [1]]             # 18: Cat 上采样后的P4 + 处理后的P3 (13)
  - [-1, 3, C2f, [256]]                     # 19 (Head P3/8-small)

  # --------------------------------------------------------
  # Step 3: PAN (Bottom-up)
  # --------------------------------------------------------
  - [-1, 1, Conv, [256, 3, 2]]             # 20
  - [[-1, 16], 1, Concat, [1]]             # 21: Cat Head P4 (Layer 16)
  - [-1, 3, C2f, [512]]                     # 22 (Head P4/16-medium)

  - [-1, 1, SCDown, [512, 3, 2]]           # 23: YOLOv10 特有的 SCDown 下采样
  - [[-1, 11], 1, Concat, [1]]             # 24: Cat 处理后的P5 (Layer 11)
  - [-1, 3, C2fCIB, [1024, True, True]]    # 25 (Head P5/32-large) - YOLOv10 特有模块

  # --------------------------------------------------------
  # Step 4: Detect
  # --------------------------------------------------------
  - [[19, 22, 25], 1, v10Detect, [nc]] # Detect(P3, P4, P5)